# Missing Data in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(["Sam",np.nan,"Tim","Kim"])
s

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [3]:
s.isnull().sum()

1

In [4]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [5]:
s[3]=None
s.isnull().sum()

2

In [6]:
s.dropna()

0    Sam
2    Tim
dtype: object

In [8]:
from numpy import nan as NA

In [36]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]], columns= ['a','b','c'])
df

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [37]:
df.isnull().sum()

a    1
b    2
c    1
dtype: int64

In [38]:
df.dropna()

     a    b    c
0  1.0  2.0  3.0

In [39]:
df.head()

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [40]:
df.dropna(thresh=0)

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [45]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]], columns= ['a','b','c'])

df.dropna(thresh=1,inplace=True)
df.head()

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [46]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]], columns= ['a','b','c'])

df.dropna(thresh=2,inplace=True)
df.head()

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [47]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]], columns= ['a','b','c'])

df.dropna(thresh=3,inplace=True)
df.head()

     a    b    c
0  1.0  2.0  3.0

In [25]:
df['a'].dropna()

0    1.0
1    4.0
Name: a, dtype: float64

In [32]:
df.head()

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [33]:
df.fillna(0)

     a    b    c
0  1.0  2.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [34]:
df.fillna(0,inplace=True)
df

     a    b    c
0  1.0  2.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [48]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [49]:
data=pd.Series([1,0,NA,5])
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [53]:
data.fillna(data.mean())

0    1.0
1    0.0
2    5.0
3    5.0
dtype: float64

In [ ]:
df

In [ ]:
df.fillna(df.mean())